jinho-yoo/esp32s3-eye/esp32s3-eye-sdcard-usbotg/main/main.c
bool is_started_usbotg_sdcard()
{
    return sd_started;
}

void sdcard_only_init(void) {
    esp_err_t ret;

    // SDMMC 호스트 설정
    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    host.flags = SDMMC_HOST_FLAG_1BIT;  // 1비트 모드 설정

    // SDMMC 슬롯 설정 (1비트 모드)
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width = 1;  // 1비트 모드 지정

    // On chips where the GPIOs used for SD card can be configured, set the user defined values
#ifdef CONFIG_SOC_SDMMC_USE_GPIO_MATRIX
    slot_config.clk = CONFIG_EXAMPLE_PIN_CLK;
    slot_config.cmd = CONFIG_EXAMPLE_PIN_CMD;
    slot_config.d0 = CONFIG_EXAMPLE_PIN_D0;
#ifdef CONFIG_EXAMPLE_SDMMC_BUS_WIDTH_4
    slot_config.d1 = CONFIG_EXAMPLE_PIN_D1;
    slot_config.d2 = CONFIG_EXAMPLE_PIN_D2;
    slot_config.d3 = CONFIG_EXAMPLE_PIN_D3;
#endif  // CONFIG_EXAMPLE_SDMMC_BUS_WIDTH_4
#endif
    // Enable internal pullups on enabled pins. The internal pullups
    // are insufficient however, please make sure 10k external pullups are
    // connected on the bus. This is for debug / example purpose only.
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;
	
	
    // FAT 파일 시스템 마운트 설정
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,  // 마운트 실패 시 포맷 여부
        .max_files = 5,                   // 최대 열 수 있는 파일 수
        .allocation_unit_size = 16 * 1024  // 클러스터 크기
    };

    sdmmc_card_t *card;
    ret = esp_vfs_fat_sdmmc_mount(BASE_PATH, &host, &slot_config, &mount_config, &card);
    if (ret != ESP_OK) {
        printf("Failed to mount SD card: %s\n", esp_err_to_name(ret));
        return;
    }

    printf("SD card mounted successfully in 1-bit mode!\n");

    // 파일 생성 및 쓰기
    FILE *f = fopen(BASE_PATH"/test.txt", "w");
    if (f) {
        for (int p=0;p<24000;p++)
        fprintf(f, "%d Hello from ESP32-S3 using SDMMC 1-bit mode FAT32!\n", p);
        fclose(f);
        printf("File written successfully\n");
    } else {
        printf("Failed to open file for writing\n");
    }

    test_file('a');
    // SD 카드 언마운트 (필요한 경우)
    esp_vfs_fat_sdcard_unmount(BASE_PATH, card);
}



int faudio=0;
void test_fileaudio(uint8_t ch)
{
    FILE *fd;
    const char *filename = BASE_PATH "/audio1.txt";
    if (faudio==0) {
      fd = fopen(filename, "w");
      faudio=1;
    } else {
      fd = fopen(filename, "a");
    }
    fprintf(fd, "0Mass Storage Devices file creation test.\n");
    for (int kk=0;kk<TESTSIZE;kk++) {
        //fprintf(fd, "0x%02x, ", kk);
        testdata[kk]='0'+(kk%10);
        if (testdata[kk]=='0') testdata[kk]='\n';
        //if (kk%10==0) fprintf(fd, "\n");
        //fflush(fd);
    }
    fwrite(testdata, TESTSIZE, 1, fd);
    
    fclose(fd);
    
}

#endif

///////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////
// for sdcard (end)
///////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////
// this is hard coded yoojh(begin)
#define NUM_CHANNELS        (1) // For mono recording only!
#define CONFIG_EXAMPLE_SAMPLE_RATE 44100 // refer  i2s_recorder_main.c, Kconfig.probuild
#define CONFIG_EXAMPLE_BIT_SAMPLE 16 // refer  i2s_recorder_main.c, Kconfig.probuild
#define SAMPLE_SIZE         (CONFIG_EXAMPLE_BIT_SAMPLE * 1024)
#define BYTE_RATE           (CONFIG_EXAMPLE_SAMPLE_RATE * (CONFIG_EXAMPLE_BIT_SAMPLE / 8)) * NUM_CHANNELS
// this is hard coded yoojh(end)

#define SAMPLE_RATE        16000       // 샘플 레이트 (16kHz)
#define PCM_BUFFER_SIZE    1024        // PCM 버퍼 크기
#define I2S_NUM            I2S_NUM_1   // I2S 포트


#define AUDIO_SIZE 24000
#define TEXT_BUF_SIZE 256

int8_t audio_buffer[AUDIO_SIZE] __attribute__((section(".ext_ram.bss")));;
char text_buffer[TEXT_BUF_SIZE];

int count=0;

int fill_pcm = 0;
int fill_cnt = 0;

static i2s_chan_handle_t rx_handle = NULL;
lv_obj_t *label;  // LCD에 텍스트를 표시할 레이블 객체


// I2S 초기화 함수
static esp_err_t i2s_init(void) {
    i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM, I2S_ROLE_MASTER);
    ESP_ERROR_CHECK(i2s_new_channel(&chan_cfg, NULL, &rx_handle));

    i2s_std_config_t std_cfg = {
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(SAMPLE_RATE),
        .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_8BIT, I2S_SLOT_MODE_MONO),
        .gpio_cfg = {
            .mclk = GPIO_NUM_NC,     // Master clock (사용하지 않음)
            .bclk = GPIO_NUM_41,     // Bit clock
            .ws   = GPIO_NUM_42,     // Word select
            .din  = GPIO_NUM_2,      // Data input
            .dout = GPIO_NUM_NC,     // Data output (사용하지 않음)
        },
    };
    ESP_ERROR_CHECK(i2s_channel_init_std_mode(rx_handle, &std_cfg));
    ESP_ERROR_CHECK(i2s_channel_enable(rx_handle));
    return ESP_OK;
}

// LVGL 태스크 함수
static void lvgl_task(void *arg) {
    while (1) {
        bsp_display_lock(0);  // LVGL Mutex 잠금
        lv_timer_handler();   // LVGL 이벤트 처리
        bsp_display_unlock(); // LVGL Mutex 해제
        vTaskDelay(pdMS_TO_TICKS(10));  // 10ms 대기
    }
}

int mycc=0;
FILE *gfd;

// PCM 데이터 읽기 및 LCD 출력
static void read_pcm_data(void *arg) {

#ifdef myUSBOTG_SDCARD
    //while (!is_started_usbotg_sdcard()) ;
#endif

    int8_t *pcm_buffer = (int8_t *)malloc(PCM_BUFFER_SIZE * sizeof(int8_t));
    if (!pcm_buffer) {
        ESP_LOGE(TAG, "Failed to allocate PCM buffer");
        vTaskDelete(NULL);
        return;
    }

   /* audio_buffer = (int8_t *)malloc(AUDIO_SIZE);

    if (!audio_buffer) {
        ESP_LOGE(TAG, "Failed to allocate audio buffer");
        vTaskDelete(NULL);
        return;
    }*/
/*
    // Use POSIX and C standard library functions to work with files.
    int flash_wr_size = 0;
    ESP_LOGI(TAG, "Opening file");    

        // First check if file exists before creating a new file.
        struct stat st;
        if (stat(SD_MOUNT_POINT"/record.wav", &st) == 0) {
            // Delete it if it exists
            unlink(SD_MOUNT_POINT"/record.wav");
        }
    
