jinho-yoo/esp32s3-eye/esp32s3-eye-sdcard-usbotg/main/main.c
        // Create new WAV file
        FILE *f = fopen(SD_MOUNT_POINT"/record.wav", "a");
        if (f == NULL) {
            ESP_LOGE(TAG, "Failed to open file for writing");
            return;
        }
    
        // Write the header to the WAV file
        fwrite(&wav_header, sizeof(wav_header), 1, f);
*/
/*
if (count==0) {
// save wav file(begin)
uint32_t rec_time=15; // 15 sec hard coding later will be fixed yoojh
uint32_t flash_rec_time = BYTE_RATE * rec_time;
const wav_header_t wav_header =
//WAV_HEADER_PCM_DEFAULT(flash_rec_time, 16, CONFIG_EXAMPLE_SAMPLE_RATE, 1); //SAMPLE_RATE
WAV_HEADER_PCM_DEFAULT(flash_rec_time, 16, SAMPLE_RATE, 1);

// First check if file exists before creating a new file.
struct stat st;
const char *fn1 = BASE_PATH "/record.wav";
if (stat(fn1, &st) == 0) {
// Delete it if it exists
unlink(fn1);
}
} // if (count==0)

// Create new WAV file
FILE *f = fopen(SD_MOUNT_POINT "/record.wav", "wb+");
if (f == NULL) {
ESP_LOGE(TAG, "Failed to open file for writing");
return;
}

//// Write the header to the WAV file
fprintf(f, "%d) start.\n", count++);
*/
// save wav file(begin)

    while (true) {
        size_t bytes_read = 0;

        // PCM 데이터를 읽어서 버퍼에 저장
        esp_err_t ret = i2s_channel_read(rx_handle, pcm_buffer, PCM_BUFFER_SIZE * sizeof(int8_t), &bytes_read, portMAX_DELAY);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to read PCM data: %s", esp_err_to_name(ret));
            continue;
        }
        //fwrite(pcm_buffer, bytes_read, 1, f);
        /*
        if (count<200) fprintf(f, "%d) start.%d\n", count++, bytes_read);
        if (count==200) fclose(f);
        */
      
        if (!fill_pcm && bytes_read)
        {
            for (size_t i = 0; i < bytes_read ; i++)
            {
                if (fill_cnt < AUDIO_SIZE)
                    audio_buffer[fill_cnt] = pcm_buffer[2 * i];//(int8_t)((pcm_buffer[2 * i] - 32768) / 256);
                else
                    break;

                fill_cnt++;
            }
        }

        if (fill_cnt == AUDIO_SIZE)
        {
            fill_pcm = 1;
            fill_cnt = 0;
        }

 
 
        ESP_LOGI(TAG, "PCM: %d %d %d %d %d %d %d %d %d %d %d %d", pcm_buffer[0], pcm_buffer[1], pcm_buffer[2], pcm_buffer[3], pcm_buffer[4], pcm_buffer[5]
        , pcm_buffer[6], pcm_buffer[7], pcm_buffer[8], pcm_buffer[9], pcm_buffer[10], pcm_buffer[11]);  // 로그로 출력
#if 0
//#ifdef myUSBOTG_SDCARD
        if (mycc<10) test_file(pcm_buffer[0]); //write((uint8_t)pcm_buffer[0]);

        char *filename = BASE_PATH "/audiof.wav";        
        FILE *gfd = fopen(filename, "a");
        for (int k=0;k<10;k++) {
          fprintf(gfd, "%d]0x%02x,", k,pcm_buffer[k]);
        }
        fprintf(gfd, "\n");
        fclose(gfd);
    
        mycc++;
#endif  
        // // CPU 사용량 감소를 위해 대기
    }
    //fclose(f);
    free(pcm_buffer);
    vTaskDelete(NULL);
}

#if 0
// direct save(begin)

#define NUM_CHANNELS        (1) // For mono recording only!

#define SAMPLE_SIZE         (CONFIG_EXAMPLE_BIT_SAMPLE * 1024)
#define BYTE_RATE           (CONFIG_EXAMPLE_SAMPLE_RATE * (CONFIG_EXAMPLE_BIT_SAMPLE / 8)) * NUM_CHANNELS
#define CONFIG_EXAMPLE_SAMPLE_RATE 44100
#define CONFIG_EXAMPLE_REC_TIME 15


size_t bytes_read;
static int16_t i2s_readraw_buff[SAMPLE_SIZE];

void record_wav(uint32_t rec_time)
{
    // Use POSIX and C standard library functions to work with files.
    int flash_wr_size = 0;
    ESP_LOGI(TAG, "Opening file");

    uint32_t flash_rec_time = BYTE_RATE * rec_time;
    const wav_header_t wav_header =
        WAV_HEADER_PCM_DEFAULT(flash_rec_time, 16, CONFIG_EXAMPLE_SAMPLE_RATE, 1);

    // First check if file exists before creating a new file.
    struct stat st;
    if (stat(BASE_PATH"/record.wav", &st) == 0) {
        // Delete it if it exists
        unlink(BASE_PATH"/record.wav");
    }

    // Create new WAV file
    //FILE *f = fopen(BASE_PATH"/record.wav", "a");
    FILE *f = fopen(BASE_PATH"/record.wav", "wb");
    if (f == NULL) {
        ESP_LOGE(TAG, "Failed to open file for writing");
        return;
    }

    // Write the header to the WAV file
    fwrite(&wav_header, sizeof(wav_header), 1, f);

    // Start recording
    while (flash_wr_size < flash_rec_time) {
        // Read the RAW samples from the microphone
        if (i2s_channel_read(rx_handle, (char *)i2s_readraw_buff, SAMPLE_SIZE, &bytes_read, 1000) == ESP_OK) {
            printf("[0] %d [1] %d [2] %d [3]%d ...\n", i2s_readraw_buff[0], i2s_readraw_buff[1], i2s_readraw_buff[2], i2s_readraw_buff[3]);
            // Write the samples to the WAV file
            fwrite(i2s_readraw_buff, bytes_read, 1, f);
            flash_wr_size += bytes_read;
        } else {
            printf("Read Failed!\n");
        }
    }

    ESP_LOGI(TAG, "Recording done!");
    fclose(f);
    ESP_LOGI(TAG, "File written on SDCard");

    // All done, unmount partition and disable SPI peripheral
    //yoojh esp_vfs_fat_sdcard_unmount(BASE_PATH, card);
    ESP_LOGI(TAG, "Card unmounted");
    // Deinitialize the bus after all devices are removed
    //yoojh spi_bus_free(host.slot); yoojh check this as comment later
}

// direct save(end)
#endif

#if 0
void app_main(void) {

    ESP_LOGI("MEMORY", "Free internal heap: %d bytes", heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
    ESP_LOGI("MEMORY", "Free PSRAM heap: %d bytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM));

  
	ESP_LOGI(TAG, "Initializing I2S...");
    if (i2s_init() != ESP_OK) {
        ESP_LOGE(TAG, "I2S initialization failed");
        return;
    }

    ESP_LOGI(TAG, "Initializing BSP...");
    //yoojh
#if 0    
    lv_display_t *disp = bsp_display_start();
    if (!disp) {
        ESP_LOGE(TAG, "Failed to initialize display.");
        return;
    }

    // 백라이트 설정
    ESP_ERROR_CHECK(bsp_display_brightness_set(100));

    //yoojh 1->0
#if 1
    // LVGL 화면 초기화
    bsp_display_lock(0);  // LVGL Mutex 잠금

    lv_obj_t *scr = lv_obj_create(NULL);  // 새 화면 생성
    lv_scr_load(scr);                     // 새 화면 활성화

    label = lv_label_create(scr);  // 레이블 생성
    lv_obj_set_width(label, 200); // Label 너비 설정
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label, "yoojh_OK-PCM: Initializing...");  // 초기 텍스트 설정
    lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);       // 화면 중앙에 배치

    bsp_display_unlock();  // LVGL Mutex 해제
#endif
#endif
    ESP_LOGI(TAG, "Starting tasks...");
    //yoojh audio_setup();

