jinho-yoo/esp32s3-eye/esp32s3-eye-sdcard-usbotg/main/main.c
#ifdef myUSBOTG_SDCARD
    usbotg_sdcard();
    test_file('a');
#endif
#if 0
#ifdef myUSBOTG_SDCARD
        char *filename = BASE_PATH "/audiof.wav";        
        FILE *gfd = fopen(filename, "a");
#endif  
#endif

record_wav(CONFIG_EXAMPLE_REC_TIME);

#if 0
    // LVGL 태스크 실행
    xTaskCreatePinnedToCore(lvgl_task, "LVGL_Task", 4 * 1024, NULL, 1, NULL, 1);

    // PCM 데이터 읽기 태스크 실행
    xTaskCreatePinnedToCore(read_pcm_data, "read_pcm_data", 4 * 1024, NULL, 5, NULL, 0);



    while (1) {
        if (fill_pcm)
        {
            memset(text_buffer,0,TEXT_BUF_SIZE);
            int top_ind = audio_inference(audio_buffer);
            //test_filewrite();


            bsp_display_lock(0);  // LVGL Mutex 잠금
            lv_label_set_text(label, text_buffer);  // 레이블 텍스트 업데이트
            bsp_display_unlock();  // LVGL Mutex 해제

            fill_pcm = 0;
        }
        else
        {
            vTaskDelay(pdMS_TO_TICKS(10));
        }

    }

#ifdef myUSBOTG_SDCARD
        fclose(gfd);
#endif  
#endif
}



void app_main(void) {

    ESP_LOGI("MEMORY", "Free internal heap: %d bytes", heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
    ESP_LOGI("MEMORY", "Free PSRAM heap: %d bytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM));

  
	ESP_LOGI(TAG, "Initializing I2S...");
    if (i2s_init() != ESP_OK) {
        ESP_LOGE(TAG, "I2S initialization failed");
        return;
    }

    ESP_LOGI(TAG, "Initializing BSP...");
    lv_display_t *disp = bsp_display_start();
    if (!disp) {
        ESP_LOGE(TAG, "Failed to initialize display.");
        return;
    }

    // 백라이트 설정
    ESP_ERROR_CHECK(bsp_display_brightness_set(100));

#if 1
    // LVGL 화면 초기화
    bsp_display_lock(0);  // LVGL Mutex 잠금

    lv_obj_t *scr = lv_obj_create(NULL);  // 새 화면 생성
    lv_scr_load(scr);                     // 새 화면 활성화

    label = lv_label_create(scr);  // 레이블 생성
    lv_obj_set_width(label, 200); // Label 너비 설정
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label, "yoojh_OK-PCM: Initializing...");  // 초기 텍스트 설정
    lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);       // 화면 중앙에 배치

    bsp_display_unlock();  // LVGL Mutex 해제
#endif
    ESP_LOGI(TAG, "Starting tasks...");
    audio_setup();

#ifdef myUSBOTG_SDCARD
    usbotg_sdcard();
    test_file('a');
#endif

#ifdef myUSBOTG_SDCARD
        char *filename = BASE_PATH "/audiof.wav";        
        FILE *gfd = fopen(filename, "a");
#endif  

    // LVGL 태스크 실행
    xTaskCreatePinnedToCore(lvgl_task, "LVGL_Task", 4 * 1024, NULL, 1, NULL, 1);

    // PCM 데이터 읽기 태스크 실행
    xTaskCreatePinnedToCore(read_pcm_data, "read_pcm_data", 4 * 1024, NULL, 5, NULL, 0);

    while (1) {
        if (fill_pcm)
        {
            memset(text_buffer,0,TEXT_BUF_SIZE);
            int top_ind = audio_inference(audio_buffer);
            //test_filewrite();


            bsp_display_lock(0);  // LVGL Mutex 잠금
            lv_label_set_text(label, text_buffer);  // 레이블 텍스트 업데이트
            bsp_display_unlock();  // LVGL Mutex 해제

            fill_pcm = 0;
        }
        else
        {
            vTaskDelay(pdMS_TO_TICKS(10));
        }

    }

#ifdef myUSBOTG_SDCARD
        fclose(gfd);
#endif  

}
#endif



void app_main(void) {

    ESP_LOGI("MEMORY", "Free internal heap: %d bytes", heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
    ESP_LOGI("MEMORY", "Free PSRAM heap: %d bytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM));

  
	ESP_LOGI(TAG, "Initializing I2S...");
    if (i2s_init() != ESP_OK) {
        ESP_LOGE(TAG, "I2S initialization failed");
        return;
    }
//disable DISPLAY    
#if 1
    ESP_LOGI(TAG, "Initializing BSP...");
    lv_display_t *disp = bsp_display_start();
    if (!disp) {
        ESP_LOGE(TAG, "Failed to initialize display.");
        return;
    }

    // 백라이트 설정
    ESP_ERROR_CHECK(bsp_display_brightness_set(100));

#if 1
    // LVGL 화면 초기화
    bsp_display_lock(0);  // LVGL Mutex 잠금

    lv_obj_t *scr = lv_obj_create(NULL);  // 새 화면 생성
    lv_scr_load(scr);                     // 새 화면 활성화

    label = lv_label_create(scr);  // 레이블 생성
    lv_obj_set_width(label, 200); // Label 너비 설정
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label, "yoojh_OK-PCM: Initializing...");  // 초기 텍스트 설정
    lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);       // 화면 중앙에 배치

    bsp_display_unlock();  // LVGL Mutex 해제
#endif
#endif //disable DISPLAY   

    ESP_LOGI(TAG, "Starting tasks...");
    audio_setup();

#ifdef myUSBOTG_SDCARD
    sdcard_only_init();
    
    

    usbotg_sdcard();
#endif

//disable DISPLAY    
#if 1
    // LVGL 태스크 실행
    xTaskCreatePinnedToCore(lvgl_task, "LVGL_Task", 4 * 1024, NULL, 1, NULL, 1);
#endif //disable DISPLAY

    // PCM 데이터 읽기 태스크 실행
    xTaskCreatePinnedToCore(read_pcm_data, "read_pcm_data", 4 * 1024, NULL, 5, NULL, 0);
int count=0;
//test_fileaudio('b');


    while (1) {
        if (fill_pcm)
        {
//disable DISPLAY    
          
            memset(text_buffer,0,TEXT_BUF_SIZE);

            int top_ind = audio_inference(audio_buffer);


            bsp_display_lock(0);  // LVGL Mutex 잠금
            lv_label_set_text(label, text_buffer);  // 레이블 텍스트 업데이트
            bsp_display_unlock();  // LVGL Mutex 해제

            //if (count++<1) test_fileaudio('b');

            fill_pcm = 0;
        }
        else
        {
            vTaskDelay(pdMS_TO_TICKS(10));
        }

    }

  

}